nxp-mcuxpresso/mcux-soc-svd/MIMXRT555S/MIMXRT555S.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCTL0</name>
      <description>SYSCTL0</description>
      <groupName>SYSCTL0</groupName>
      <baseAddress>0x40002000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFD4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DSP_VECT_REMAP</name>
          <description>DSP Vector Remap</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSP_VECT_REMAP</name>
              <description>DSP_VECT_REMAP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STATVECSELECT</name>
              <description>Static Vector Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>StatVecSelect_0</name>
                  <description>Selects the primary static vector base address on Fusion DSP (0x0000_0000)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>StatVecSelect_1</name>
                  <description>Selects the alternate static vector base address on Fusion DSP (0x0040_0000)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSPSTALL</name>
          <description>DSP Stall Control</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSPSTALL</name>
              <description>DSPSTALL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSPSTALL_0</name>
                  <description>Run(Normal mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSPSTALL_1</name>
                  <description>Stall mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBMATRIXPRIOR</name>
          <description>AHB MAX Priority</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M0</name>
              <description>Master 0 Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M1</name>
              <description>Master 1 Priority</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M2</name>
              <description>Master 2 Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M3</name>
              <description>Master 3 Priority</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M4</name>
              <description>Master 4 Priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M5</name>
              <description>Master 5 Priority</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M6</name>
              <description>Master 6 Priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M7</name>
              <description>Master 7 Priority</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M8</name>
              <description>Master 8 Priority</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M9</name>
              <description>Master 9 Priority</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M10</name>
              <description>Master 10 Priority</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M11</name>
              <description>Master 10 Priority</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
