nxp-mcuxpresso/mcux-soc-svd/MIMXRT555S/MIMXRT555S.xml
        <register>
          <name>BOOTROM_LCKOUT</name>
          <description>BOOT ROM lockout</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>READ_LCKOUT_SPACE</name>
              <description>Read Lockout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WRITE_LOCK</name>
              <description>Self Write Disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Write_Lock_00</name>
                  <description>Write disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Write_Lock_01</name>
                  <description>Write disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Write_Lock_11</name>
                  <description>Write enable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Write_Lock_10</name>
                  <description>Write disable</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>M33NMISRCSEL</name>
          <description>M33 NMI source selection</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NMISRCSEL</name>
              <description>Selects one of the M33 interrupt sources as the NMI source interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMI_Enable</name>
              <description>Self Write Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NMIEnable_0</name>
                  <description>Disable NMI interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMIEnable_1</name>
                  <description>Enable NMI interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEM_STICK_CALIB</name>
          <description>System secure tick calibration</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYSTEM_STICK_CALIB</name>
              <description>M33 secure tick calibration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEM_NSTICK_CALIB</name>
          <description>System non-secure tick calibration</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYSTEM_NSTICK_CALIB</name>
              <description>M33 non secure tick calibration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRODUCT_ID</name>
          <description>Product ID</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xCAFE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRODUCT_ID</name>
              <description>PRODUCT ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SILICONREV_ID</name>
          <description>Silicon Revision ID</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xB000A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MINOR</name>
              <description>MINOR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>MAJOR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAG_ID</name>
          <description>JTAG ID</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2B</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>FIXBIT</name>
              <description>JTAG ID fix bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MANU</name>
              <description>JTAG ID Manufacturer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRODUCT_ID</name>
              <description>JTAG ID Product ID as defined in the Product ID register</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHIPREV</name>
              <description>JTAG ID 4-Bit Chip Silicon Revision</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NSGPIO_PSYNC</name>
          <description>Non-secure GPIO PSYNC</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSYNC</name>
              <description>Synchronization Stage Setting:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SGPIO_PSYNC</name>
          <description>Secure GPIO PSYNC</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSYNC</name>
              <description>Synchronization Stage Setting:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PSYNC_0</name>
                  <description>2-Stage Sync</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSYNC_1</name>
                  <description>1-Stage Sync</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCLKGATEOVERRIDE0</name>
          <description>Auto clock gate override 0</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AHB2APB0</name>
              <description>AHB2APB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB2APB0_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB2APB0_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB2APB1</name>
              <description>AHB2APB1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB2APB1_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB2APB1_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_ENGINE</name>
              <description>CRC_ENGINE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_ENGINE_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_ENGINE_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CASPER</name>
              <description>CASPER</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CASPER_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CASPER_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAC0</name>
              <description>DMAC0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAC1</name>
              <description>DMAC1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC1_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
