nxp-mcuxpresso/mcux-soc-svd/MIMXRT555S/MIMXRT555S.xml
        <register>
          <name>AUTOCLKGATEOVERRIDE1</name>
          <description>Auto clock gate override 1</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0_IF</name>
              <description>SRAM0_IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM00_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM00_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1_IF</name>
              <description>SRAM1_IF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM01_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM01_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2_IF</name>
              <description>SRAM2_IF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM02_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM02_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3_IF</name>
              <description>SRAM3_IF</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM03_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM03_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM4_IF</name>
              <description>SRAM4_IF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM04_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM04_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM5_IF</name>
              <description>SRAM5_IF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM05_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM05_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM6_IF</name>
              <description>SRAM6_IF</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM06_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM06_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM7_IF</name>
              <description>SRAM7_IF</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM07_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM07_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM8_IF</name>
              <description>SRAM8_IF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM08_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM08_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM9_IF</name>
              <description>SRAM9_IF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM09_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM09_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM10_IF</name>
              <description>SRAM10_IF</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM010_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM010_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM11_IF</name>
              <description>SRAM11_IF</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM011_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM011_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM12_IF</name>
              <description>SRAM12_IF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM012_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM012_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM13_IF</name>
              <description>SRAM13_IF</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM013_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM013_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM14_IF</name>
              <description>SRAM14_IF</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM014_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM014_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM15_IF</name>
              <description>SRAM15_IF</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM015_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM015_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM16_IF</name>
              <description>SRAM16_IF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM016_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM016_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM17_IF</name>
              <description>SRAM17_IF</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM017_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM017_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM18_IF</name>
              <description>SRAM18_IF</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM018_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM018_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM19_IF</name>
              <description>SRAM19_IF</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM019_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM019_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM20_IF</name>
              <description>SRAM20_IF</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM020_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM020_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM21_IF</name>
              <description>SRAM21_IF</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM021_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM021_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM22_IF</name>
              <description>SRAM22_IF</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM022_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM022_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM23_IF</name>
              <description>SRAM23_IF</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM023_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM023_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM24_IF</name>
              <description>SRAM24_IF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM024_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM024_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM25_IF</name>
              <description>SRAM25_IF</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM025_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM025_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM26_IF</name>
              <description>SRAM26_IF</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM026_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM026_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM27_IF</name>
              <description>SRAM27_IF</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM027_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM027_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM28_IF</name>
              <description>SRAM28_IF</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM028_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM028_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM29_IF</name>
              <description>SRAM29_IF</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM029_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM029_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM30_IF</name>
              <description>SRAM30_IF</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM030_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM030_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM31_IF</name>
              <description>SRAM31_IF</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM031_IF_0</name>
                  <description>Enable clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM031_IF_1</name>
                  <description>Continuous Clocking</description>
                  <value>0x1</value>
