nxp-mcuxpresso/mcux-soc-svd/MIMXRT555S/MIMXRT555S.xml
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF28_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF29_APD</name>
              <description>Array power for RAM interface 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF29_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF29_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF30_APD</name>
              <description>Array power for RAM interface 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF30_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF30_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF31_APD</name>
              <description>Array power for RAM interface 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF31_APD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG2_SRAM_IF31_APD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSLEEPCFG3</name>
          <description>Sleep configuration 3</description>
          <addressOffset>0x60C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM_IF0_PPD</name>
              <description>Periphery power for RAM interface 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF0_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF0_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF1_PPD</name>
              <description>Periphery power for RAM interface 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF1_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF1_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF2_PPD</name>
              <description>Periphery power for RAM interface 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF2_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF2_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF3_PPD</name>
              <description>Periphery power for RAM interface 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF3_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF3_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF4_PPD</name>
              <description>Periphery power for RAM interface 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF4_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF4_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF5_PPD</name>
              <description>Periphery power for RAM interface 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF5_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF5_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF6_PPD</name>
              <description>Periphery power for RAM interface 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF6_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF6_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF7_PPD</name>
              <description>Periphery power for RAM interface 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF7_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF7_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF8_PPD</name>
              <description>Periphery power for RAM interface 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF8_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF8_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF9_PPD</name>
              <description>Periphery power for RAM interface 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF9_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF9_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF10_PPD</name>
              <description>Periphery power for RAM interface 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF10_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF10_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF11_PPD</name>
              <description>Periphery power for RAM interface 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF11_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF11_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF12_PPD</name>
              <description>Periphery power for RAM interface 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF12_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF12_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF13_PPD</name>
              <description>Periphery power for RAM interface 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF13_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF13_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF14_PPD</name>
              <description>Periphery power for RAM interface 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF14_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF14_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF15_PPD</name>
              <description>Periphery power for RAM interface 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF15_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF15_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF16_PPD</name>
              <description>Periphery power for RAM interface 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF16_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF16_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF17_PPD</name>
              <description>Periphery power for RAM interface 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF17_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF17_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF18_PPD</name>
              <description>Periphery power for RAM interface 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF18_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF18_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF19_PPD</name>
              <description>Periphery power for RAM interface 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF19_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF19_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF20_PPD</name>
              <description>Periphery power for RAM interface 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF20_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF20_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF21_PPD</name>
              <description>Periphery power for RAM interface 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF21_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF21_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF22_PPD</name>
              <description>Periphery power for RAM interface 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF22_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF22_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF23_PPD</name>
              <description>Periphery power for RAM interface 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF23_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF23_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF24_PPD</name>
              <description>Periphery power for RAM interface 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF24_PPD_0</name>
                  <description>Power down disabled or Powered ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDSLEEPCFG3_SRAM_IF24_PPD_1</name>
                  <description>Power down enabled or Powered OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_IF25_PPD</name>
