nxp-mcuxpresso/mcux-soc-svd/MIMXRT555S/MIMXRT555S.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>INPUTMUX</name>
      <description>INPUTMUX</description>
      <groupName>INPUTMUX</groupName>
      <baseAddress>0x40026000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7B4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>7</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SCT0_IN_SEL[%s]</name>
          <description>SCT Peripheral Input multiplexer index</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCT_IN_SEL</name>
              <description>SCT0 Input Selection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCT_IN_SEL_0</name>
                  <description>SCT0_PIN_INP0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_1</name>
                  <description>SCT0_PIN_INP1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_2</name>
                  <description>SCT0_PIN_INP2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_3</name>
                  <description>SCT0_PIN_INP3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_4</name>
                  <description>SCT0_PIN_INP4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_5</name>
                  <description>SCT0_PIN_INP5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_6</name>
                  <description>SCT0_PIN_INP6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_7</name>
                  <description>SCT0_PIN_INP7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_8</name>
                  <description>CT32BIT0_MAT0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_9</name>
                  <description>CT32BIT1_MAT0</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_10</name>
                  <description>CT32BIT2_MAT0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_11</name>
                  <description>CT32BIT3_MAT0</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_12</name>
                  <description>CT32BIT4_MAT0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_13</name>
                  <description>ADCIRQ</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_14</name>
                  <description>GPIOINT_BMATCH</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_15</name>
                  <description>USB0_FRAME_TOGGLE</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_16</name>
                  <description>CMP0_OUT</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_17</name>
                  <description>SHARED I2S0_SCLK</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_18</name>
                  <description>SHARED I2S1_SCLK</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_19</name>
                  <description>SHARED I2S0_WS</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_20</name>
                  <description>SHARED I2S1_WS</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_21</name>
                  <description>MCLK</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_22</name>
                  <description>ARM_TXEV</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_IN_SEL_23</name>
                  <description>DEBUG_HALTED</description>
                  <value>0x17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PINT_SEL[%s]</name>
          <description>GPIO Pin Input Multiplexer index</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PINT_SEL</name>
              <description>Interrupt select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>27</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DSP_INT_SEL[%s]</name>
          <description>Fusion DSP Interrupt Input Multiplexer</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSP_INT_SEL</name>
              <description>Fusion DSP Input(n) Selection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCOMM0</name>
                  <description>FLEXCOMM0_IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM1</name>
                  <description>FLEXCOMM1_IRQ</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM2</name>
                  <description>FLEXCOMM2_IRQ</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM3</name>
                  <description>FLEXCOMM3_IRQ</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM4</name>
                  <description>FLEXCOMM4_IRQ</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM5</name>
                  <description>FLEXCOMM5_IRQ</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM6</name>
                  <description>FLEXCOMM6_IRQ</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM7</name>
                  <description>FLEXCOMM7_IRQ</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM14</name>
                  <description>FLEXCOMM14_IRQ</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM16</name>
                  <description>FLEXCOMM16_IRQ</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ0</name>
                  <description>GPIO_INT0_IRQ0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ1</name>
                  <description>GPIO_INT0_IRQ1</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ2</name>
                  <description>GPIO_INT0_IRQ2</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ3</name>
                  <description>GPIO_INT0_IRQ3</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ4</name>
                  <description>GPIO_INT0_IRQ4</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ5</name>
                  <description>GPIO_INT0_IRQ5</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ6</name>
                  <description>GPIO_INT0_IRQ6</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT0_IRQ7</name>
                  <description>GPIO_INT0_IRQ7</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSHSGPIO_INT0</name>
                  <description>NSHSGPIO_INT0_IRQ0</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSHSGPIO_INT1</name>
                  <description>NSHSGPIO_INT1_IRQ1</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT1</name>
                  <description>WDT1</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0</name>
                  <description>DMAC0_IRQ</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC1</name>
                  <description>DMAC1_IRQ</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MU</name>
                  <description>MU_B_IRQ</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTICK0</name>
                  <description>UTICK0_IRQ</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MRT0</name>
                  <description>MRT0_IRQ</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OS_EVENT_TIMER</name>
                  <description>OS_EVENT_TIMER or OS_EVENT_WAKEUP</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER0</name>
                  <description>CTIMER0</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER1</name>
                  <description>CTIMER1</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER2</name>
                  <description>CTIMER2</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER3</name>
                  <description>CTIMER3</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER4</name>
                  <description>CTIMER4</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_LITE0_ALARM</name>
                  <description>RTC_LITE0_ALARM or RTC_LITE0_WAKEUP</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C0</name>
                  <description>I3C0</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C1</name>
                  <description>I3C1</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMIC0</name>
                  <description>DMIC0</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWVAD</name>
                  <description>HWVAD</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF_IRQ</name>
                  <description>LCDIF_IRQ</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPU_IRQ</name>
                  <description>GPU_IRQ</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMARTDMA_IRQ</name>
                  <description>SMARTDMA_IRQ</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO_IRQ</name>
                  <description>FLEXIO_IRQ</description>
                  <value>0x28</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>37</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMAC0_ITRIG_SEL[%s]</name>
          <description>DMAC0 Input Trigger Select</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_ITRIG_SEL</name>
              <description>DMA Input Trigger Selection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_INT0</name>
                  <description>GPIO_INT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT1</name>
                  <description>GPIO_INT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT2</name>
                  <description>GPIO_INT2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_INT3</name>
                  <description>GPIO_INT3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_0</name>
                  <description>T0_DMAREQ_M0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_M1</name>
                  <description>T0_DMAREQ_M1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_6</name>
                  <description>T1_DMAREQ_M0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_7</name>
                  <description>T1_DMAREQ_M1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_8</name>
                  <description>T2_DMAREQ_M0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_9</name>
                  <description>T2_DMAREQ_M1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_a</name>
                  <description>T3_DMAREQ_M0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_b</name>
                  <description>T3_DMAREQ_M1</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_c</name>
                  <description>T4_DMAREQ_M0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_d</name>
                  <description>T4_DMAREQ_M1</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T0_DMAREQ_e</name>
                  <description>DMA0_TRIGOUT_A</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0_TRIGOUT_B</name>
                  <description>DMA0_TRIGOUT_B</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0_TRIGOUT_C</name>
                  <description>DMA0_TRIGOUT_C</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0_TRIGOUT_D</name>
                  <description>DMA0_TRIGOUT_D</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT0_DMAC0</name>
                  <description>SCT_DMAC0_REQ0</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_DMAC1</name>
                  <description>SCT_DMAC1_REQ1</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASHCRYPT_OUT_DMA</name>
                  <description>HASHCRYPT_OUT_DMA</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_DMA</name>
                  <description>ACMP_DMA</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexSPI0_RX_DMA</name>
                  <description>FlexSPI0_RX_DMA</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexSPI0_TX_DMA</name>
                  <description>FlexSPI0_TX_DMA</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DMA</name>
                  <description>ADC_DMA</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexSPI1_RX_DMA</name>
                  <description>FlexSPI1_RX_DMA</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexSPI1_TX_DMA</name>
                  <description>FlexSPI1_TX_DMA</description>
                  <value>0x1A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
