nxp-mcuxpresso/mcux-soc-svd/MIMXRT555S/MIMXRT555S.xml
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMAC0_OTRIG_SEL[%s]</name>
          <description>DMAC0 Output Trigger Select</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_OTRIG_SEL</name>
              <description>DMAC0 Output Triggers Select for A, B, C, D IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH0</name>
                  <description>DMAC0_OTRIG_CH0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH1</name>
                  <description>DMAC0_OTRIG_CH1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH2</name>
                  <description>DMAC0_OTRIG_CH2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH3</name>
                  <description>DMAC0_OTRIG_CH3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH4</name>
                  <description>DMAC0_OTRIG_CH4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH5</name>
                  <description>DMAC0_OTRIG_CH5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH6</name>
                  <description>DMAC0_OTRIG_CH6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH7</name>
                  <description>DMAC0_OTRIG_CH7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH8</name>
                  <description>DMAC0_OTRIG_CH8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH9</name>
                  <description>DMAC0_OTRIG_CH9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH10</name>
                  <description>DMAC0_OTRIG_CH10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH11</name>
                  <description>DMAC0_OTRIG_CH11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH12</name>
                  <description>DMAC0_OTRIG_CH12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH13</name>
                  <description>DMAC0_OTRIG_CH13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH14</name>
                  <description>DMAC0_OTRIG_CH14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH15</name>
                  <description>DMAC0_OTRIG_CH15</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH16</name>
                  <description>DMAC0_OTRIG_CH16</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH17</name>
                  <description>DMAC0_OTRIG_CH17</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH18</name>
                  <description>DMAC0_OTRIG_CH18</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH19</name>
                  <description>DMAC0_OTRIG_CH19</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH20</name>
                  <description>DMAC0_OTRIG_CH20</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH21</name>
                  <description>DMAC0_OTRIG_CH21</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH22</name>
                  <description>DMAC0_OTRIG_CH22</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH23</name>
                  <description>DMAC0_OTRIG_CH23</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH24</name>
                  <description>DMAC0_OTRIG_CH24</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH25</name>
                  <description>DMAC0_OTRIG_CH25</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH26</name>
                  <description>DMAC0_OTRIG_CH26</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH27</name>
                  <description>DMAC0_OTRIG_CH27</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH28</name>
                  <description>DMAC0_OTRIG_CH28</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH29</name>
                  <description>DMAC0_OTRIG_CH29</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH30</name>
                  <description>DMAC0_OTRIG_CH30</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH31</name>
                  <description>DMAC0_OTRIG_CH31</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH32</name>
                  <description>DMAC0_OTRIG_CH32</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH33</name>
                  <description>DMAC0_OTRIG_CH33</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH34</name>
                  <description>DMAC0_OTRIG_CH34</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH35</name>
                  <description>DMAC0_OTRIG_CH35</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_OTRIG_CH36</name>
                  <description>DMAC0_OTRIG_CH36</description>
                  <value>0x24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL0</name>
          <description>DMAC0 Channel mux select 0</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>DMIC_CH0_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_1</name>
                  <description>FLEXCOM8_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL1</name>
          <description>DMAC0 Channel mux select 1</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>DMIC_CH1_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_1</name>
                  <description>FLEXCOM8_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL2</name>
          <description>DMAC0 Channel mux select 2</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>DMIC_CH2_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_1</name>
                  <description>FLEXCOM9_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL3</name>
          <description>DMAC0 Channel mux select 3</description>
          <addressOffset>0x32C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>DMIC_CH3_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_1</name>
                  <description>FLEXCOM9_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL4</name>
          <description>DMAC0 Channel mux select 4</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>DMIC_CH4_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_1</name>
                  <description>FLEXCOM10_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL5</name>
          <description>DMAC0 Channel mux select 5</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>DMIC_CH5_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_1</name>
                  <description>FLEXCOM10_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL6</name>
          <description>DMAC0 Channel mux select 6</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>DMIC_CH6_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_1</name>
                  <description>FLEXCOM13_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL7</name>
          <description>DMAC0 Channel mux select 7</description>
          <addressOffset>0x33C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>DMIC_CH7_DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_1</name>
                  <description>FLEXCOM13_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL8</name>
          <description>DMAC0 Channel mux select 8</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>FLEXCOM16_RX_DMA</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL9</name>
          <description>DMAC0 Channel mux select 9</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>FLEXCOM16_TX_DMA</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL10</name>
          <description>DMAC0 Channel mux select 10</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>I3C1_RX_DMA</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL11</name>
          <description>DMAC0 Channel mux select 11</description>
          <addressOffset>0x34C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_0</name>
                  <description>I3C1_TX_DMA</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL12</name>
          <description>DMAC0 Channel mux select 12</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_1</name>
                  <description>FLEXCOM11_RX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_CHMUX_SEL13</name>
          <description>DMAC0 Channel mux select 13</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAC0_CHMUX_SEL</name>
              <description>DMAC0 Channel mux select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAC0_CHMUX_SEL_1</name>
                  <description>FLEXCOM11_TX_DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
