nxp-mcuxpresso/mcux-soc-svd/MIMXRT555S/MIMXRT555S.xml
        <register>
          <name>CT32BIT4_CAP2_SEL</name>
          <description>CT32BIT Timer Capture Multiplexers</description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPn_SEL</name>
              <description>Counter Timer n, Capture Input m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT_INP0</name>
                  <description>CT_INP0 (function must be selected in IOPCTL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP1</name>
                  <description>CT_INP1 (function must be selected in IOPCTL)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP2</name>
                  <description>CT_INP2 (function must be selected in IOPCTL)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP3</name>
                  <description>CT_INP3 (function must be selected in IOPCTL)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP4</name>
                  <description>CT_INP4 (function must be selected in IOPCTL)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP5</name>
                  <description>CT_INP5 (function must be selected in IOPCTL)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP6</name>
                  <description>CT_INP6 (function must be selected in IOPCTL)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP7</name>
                  <description>CT_INP7 (function must be selected in IOPCTL)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP8</name>
                  <description>CT_INP8 (function must be selected in IOPCTL)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP9</name>
                  <description>CT_INP9 (function must be selected in IOPCTL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP10</name>
                  <description>CT_INP10 (function must be selected in IOPCTL)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP11</name>
                  <description>CT_INP11 (function must be selected in IOPCTL)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP12</name>
                  <description>CT_INP12 (function must be selected in IOPCTL)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP13</name>
                  <description>CT_INP13 (function must be selected in IOPCTL)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP14</name>
                  <description>CT_INP14 (function must be selected in IOPCTL)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP15</name>
                  <description>CT_INP15 (function must be selected in IOPCTL)</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP16</name>
                  <description>SHARED I2S0_WS</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP17</name>
                  <description>SHARED I2S1_WS</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP18</name>
                  <description>USB1_FRAME_TOGGLE (see USB Controller Chapter)</description>
                  <value>0x12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CT32BIT4_CAP3_SEL</name>
          <description>CT32BIT Timer Capture Multiplexers</description>
          <addressOffset>0x64C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPn_SEL</name>
              <description>Counter Timer n, Capture Input m</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CT_INP0</name>
                  <description>CT_INP0 (function must be selected in IOPCTL)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP1</name>
                  <description>CT_INP1 (function must be selected in IOPCTL)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP2</name>
                  <description>CT_INP2 (function must be selected in IOPCTL)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP3</name>
                  <description>CT_INP3 (function must be selected in IOPCTL)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP4</name>
                  <description>CT_INP4 (function must be selected in IOPCTL)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP5</name>
                  <description>CT_INP5 (function must be selected in IOPCTL)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP6</name>
                  <description>CT_INP6 (function must be selected in IOPCTL)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP7</name>
                  <description>CT_INP7 (function must be selected in IOPCTL)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP8</name>
                  <description>CT_INP8 (function must be selected in IOPCTL)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP9</name>
                  <description>CT_INP9 (function must be selected in IOPCTL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP10</name>
                  <description>CT_INP10 (function must be selected in IOPCTL)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP11</name>
                  <description>CT_INP11 (function must be selected in IOPCTL)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP12</name>
                  <description>CT_INP12 (function must be selected in IOPCTL)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP13</name>
                  <description>CT_INP13 (function must be selected in IOPCTL)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP14</name>
                  <description>CT_INP14 (function must be selected in IOPCTL)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP15</name>
                  <description>CT_INP15 (function must be selected in IOPCTL)</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP16</name>
                  <description>SHARED I2S0_WS</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP17</name>
                  <description>SHARED I2S1_WS</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_INP18</name>
                  <description>USB1_FRAME_TOGGLE (see USB Controller Chapter)</description>
                  <value>0x12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FMEASURE_CH_SEL[%s]</name>
          <description>Frequency Measurement Input Channel Multiplexers</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMEASURE_SEL</name>
              <description>Frequency Measure Channel Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FMEASURE_SEL0</name>
                  <description>OSC_CLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMEASURE_SEL1</name>
                  <description>FRO_DIV16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMEASURE_SEL2</name>
                  <description>FRO_DIV1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMEASURE_SEL3</name>
                  <description>Low Power Oscillator Clock (LPOSC)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMEASURE_SEL4</name>
                  <description>RTC 32 kHz OSC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMEASURE_SEL5</name>
                  <description>Main SYSCLK</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMEASURE_SEL6</name>
                  <description>FREQME_GPIO_CLK</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMEASURE_SEL11</name>
                  <description>Clock Out</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SMART_DMA_TRIG_CH_SEL[%s]</name>
          <description>SMART_DMA trigger channel select</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMART_DMA_IN_SEL</name>
              <description>SMART_DMA Input(n) Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
