nxp-mcuxpresso/mcux-soc-svd/MIMXRT555S/MIMXRT555S.xml
        <register>
          <name>GATE9</name>
          <description>Gate</description>
          <addressOffset>0xA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D0</name>
                  <description>Domain 0 locked the gate.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D1</name>
                  <description>Domain 1 locked the gate.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D2</name>
                  <description>Domain 2 locked the gate.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D3</name>
                  <description>Domain 3 locked the gate.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D4</name>
                  <description>Domain 4 locked the gate.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D5</name>
                  <description>Domain 5 locked the gate.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D6</name>
                  <description>Domain 6 locked the gate.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D7</name>
                  <description>Domain 7 locked the gate.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D8</name>
                  <description>Domain 8 locked the gate.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D9</name>
                  <description>Domain 9 locked the gate.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D10</name>
                  <description>Domain 10 locked the gate.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D11</name>
                  <description>Domain 11 locked the gate.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D12</name>
                  <description>Domain 12 locked the gate.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D13</name>
                  <description>Domain 13 locked the gate.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D14</name>
                  <description>Domain 14 locked the gate.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GATE8</name>
          <description>Gate</description>
          <addressOffset>0xB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D0</name>
                  <description>Domain 0 locked the gate.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D1</name>
                  <description>Domain 1 locked the gate.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D2</name>
                  <description>Domain 2 locked the gate.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D3</name>
                  <description>Domain 3 locked the gate.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D4</name>
                  <description>Domain 4 locked the gate.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D5</name>
                  <description>Domain 5 locked the gate.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D6</name>
                  <description>Domain 6 locked the gate.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D7</name>
                  <description>Domain 7 locked the gate.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D8</name>
                  <description>Domain 8 locked the gate.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D9</name>
                  <description>Domain 9 locked the gate.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D10</name>
                  <description>Domain 10 locked the gate.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D11</name>
                  <description>Domain 11 locked the gate.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D12</name>
                  <description>Domain 12 locked the gate.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D13</name>
                  <description>Domain 13 locked the gate.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D14</name>
                  <description>Domain 14 locked the gate.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GATE15</name>
          <description>Gate</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D0</name>
                  <description>Domain 0 locked the gate.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D1</name>
                  <description>Domain 1 locked the gate.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D2</name>
                  <description>Domain 2 locked the gate.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D3</name>
                  <description>Domain 3 locked the gate.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D4</name>
                  <description>Domain 4 locked the gate.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D5</name>
                  <description>Domain 5 locked the gate.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D6</name>
                  <description>Domain 6 locked the gate.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D7</name>
                  <description>Domain 7 locked the gate.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D8</name>
                  <description>Domain 8 locked the gate.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D9</name>
                  <description>Domain 9 locked the gate.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D10</name>
                  <description>Domain 10 locked the gate.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D11</name>
                  <description>Domain 11 locked the gate.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D12</name>
                  <description>Domain 12 locked the gate.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D13</name>
                  <description>Domain 13 locked the gate.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D14</name>
                  <description>Domain 14 locked the gate.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GATE14</name>
          <description>Gate</description>
          <addressOffset>0xD</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D0</name>
                  <description>Domain 0 locked the gate.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D1</name>
                  <description>Domain 1 locked the gate.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D2</name>
                  <description>Domain 2 locked the gate.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D3</name>
                  <description>Domain 3 locked the gate.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D4</name>
                  <description>Domain 4 locked the gate.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D5</name>
                  <description>Domain 5 locked the gate.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D6</name>
                  <description>Domain 6 locked the gate.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D7</name>
                  <description>Domain 7 locked the gate.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D8</name>
                  <description>Domain 8 locked the gate.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D9</name>
                  <description>Domain 9 locked the gate.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D10</name>
                  <description>Domain 10 locked the gate.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D11</name>
                  <description>Domain 11 locked the gate.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D12</name>
                  <description>Domain 12 locked the gate.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D13</name>
                  <description>Domain 13 locked the gate.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D14</name>
                  <description>Domain 14 locked the gate.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GATE13</name>
          <description>Gate</description>
          <addressOffset>0xE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D0</name>
                  <description>Domain 0 locked the gate.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D1</name>
                  <description>Domain 1 locked the gate.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D2</name>
                  <description>Domain 2 locked the gate.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D3</name>
                  <description>Domain 3 locked the gate.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D4</name>
                  <description>Domain 4 locked the gate.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D5</name>
                  <description>Domain 5 locked the gate.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D6</name>
                  <description>Domain 6 locked the gate.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D7</name>
                  <description>Domain 7 locked the gate.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D8</name>
                  <description>Domain 8 locked the gate.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D9</name>
                  <description>Domain 9 locked the gate.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D10</name>
                  <description>Domain 10 locked the gate.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D11</name>
                  <description>Domain 11 locked the gate.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D12</name>
                  <description>Domain 12 locked the gate.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D13</name>
                  <description>Domain 13 locked the gate.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED_BY_D14</name>
                  <description>Domain 14 locked the gate.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
