nxp-mcuxpresso/mcux-soc-svd/MIMXRT555S/MIMXRT555S.xml
        <register>
          <name>C1</name>
          <description>CMP Control Register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOSEL</name>
              <description>DAC Output Voltage Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMODE</name>
              <description>DAC Mode Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMODE_0</name>
                  <description>DAC is selected to work in low speed and low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMODE_1</name>
                  <description>DAC is selected to work in high speed high power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VRSEL</name>
              <description>Supply Voltage Reference Source Select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VRSEL_0</name>
                  <description>Vin1 is selected as resistor ladder network supply reference Vin. Vin1 is from internal PMC.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VRSEL_1</name>
                  <description>Vin2 is selected as resistor ladder network supply reference Vin. Vin2 is from PAD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACEN</name>
              <description>DAC Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DACEN_0</name>
                  <description>DAC is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACEN_1</name>
                  <description>DAC is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSEL_SEC</name>
              <description>Secondary Plus channel select.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT_0</name>
                  <description>Input 0 for Plus Channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_1</name>
                  <description>Input 1 for Plus Channel</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_2</name>
                  <description>Input 2 for Plus Channel</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_3</name>
                  <description>Input 3 for Plus Channel</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_4</name>
                  <description>Input 4 for Plus Channel</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_5</name>
                  <description>Input 5 for Plus Channel</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_6</name>
                  <description>Input 6 for Plus Channel</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNAL</name>
                  <description>Internal 8b DAC output for Plus Channel</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHN0</name>
              <description>Channel 0 input enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN1</name>
              <description>Channel 1 input enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN2</name>
              <description>Channel 2 input enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN3</name>
              <description>Channel 3 input enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN4</name>
              <description>Channel 4 input enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHN5</name>
              <description>Channel 5 input enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSEL</name>
              <description>Minus Input MUX Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSEL_0</name>
                  <description>Internal Negative Input 0 for Minus Channel -- Internal Minus Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_1</name>
                  <description>External Input 1 for Minus Channel -- Reference Input 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_2</name>
                  <description>External Input 2 for Minus Channel -- Reference Input 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_3</name>
                  <description>External Input 3 for Minus Channel -- Reference Input 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_4</name>
                  <description>External Input 4 for Minus Channel -- Reference Input 3</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_5</name>
                  <description>External Input 5 for Minus Channel -- Reference Input 4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_6</name>
                  <description>External Input 6 for Minus Channel -- Reference Input 5</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSEL_7</name>
                  <description>Internal 8b DAC output</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSEL</name>
              <description>Plus Input MUX Control</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PSEL_0</name>
                  <description>Internal Posivite Input 0 for Plus Channel -- Internal Minus Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_1</name>
                  <description>External Input 1 for Plus Channel -- Reference Input 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_2</name>
                  <description>External Input 2 for Plus Channel -- Reference Input 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_3</name>
                  <description>External Input 3 for Plus Channel -- Reference Input 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_4</name>
                  <description>External Input 4 for Plus Channel -- Reference Input 3</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_5</name>
                  <description>External Input 4 for Plus Channel -- Reference Input 4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_6</name>
                  <description>External Input 4 for Plus Channel -- Reference Input 5</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_7</name>
                  <description>Internal 8b DAC output</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>C2</name>
          <description>CMP Control Register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACOn</name>
              <description>ACOn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INITMOD</name>
              <description>Comparator and DAC initialization delay modulus.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSAM</name>
              <description>Number of sample clocks</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NSAM_0</name>
                  <description>The comparison result is sampled as soon as the active channel is scanned in one round-robin clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSAM_1</name>
                  <description>The sampling takes place 1 round-robin clock cycle after the next cycle of the round-robin clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSAM_2</name>
                  <description>The sampling takes place 2 round-robin clock cycles after the next cycle of the round-robin clock.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NSAM_3</name>
                  <description>The sampling takes place 3 round-robin clock cycles after the next cycle of the round-robin clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH0F</name>
              <description>CH0F</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH1F</name>
              <description>CH1F</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH2F</name>
              <description>CH2F</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH3F</name>
              <description>CH3F</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH4F</name>
              <description>CH4F</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH5F</name>
              <description>CH5F</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FXMXCH</name>
              <description>Fixed channel selection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FXMXCH_0</name>
                  <description>External Reference Input 0 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_1</name>
                  <description>External Reference Input 1 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_2</name>
                  <description>External Reference Input 2 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_3</name>
                  <description>External Reference Input 3 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_4</name>
                  <description>External Reference Input 4 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_5</name>
                  <description>External Reference Input 5 is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMXCH_7</name>
                  <description>The 8bit DAC is selected as the fixed reference input for the fixed mux port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FXMP</name>
              <description>Fixed MUX Port</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FXMP_0</name>
                  <description>The Plus port is fixed. Only the inputs to the Minus port are swept in each round.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXMP_1</name>
                  <description>The Minus port is fixed. Only the inputs to the Plus port are swept in each round.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRIE</name>
              <description>Round-Robin interrupt enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RRIE_0</name>
                  <description>The round-robin interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RRIE_1</name>
                  <description>The round-robin interrupt is enabled when a comparison result changes from the last sample.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
