nxp-mcuxpresso/mcux-soc-svd/MIMXRT555S/MIMXRT555S.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WDT0</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>DMA0</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>GPIO_INTA</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>GPIO_INTB</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT0</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT1</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT2</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT3</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>UTICK0</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>MRT0</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>CTIMER0</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>CTIMER1</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>SCT0</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>CTIMER3</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM0</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM1</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM2</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM3</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM4</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM5</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM14</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM15</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>ADC0</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>Reserved39</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>ACMP</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>DMIC0</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>Reserved42</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>HYPERVISOR</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>SECURE_VIOLATION</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>HWVAD0</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>Reserved46</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>RNG</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>MU_A</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT4</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT5</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT6</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT7</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>CTIMER2</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>CTIMER4</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>OS_EVENT</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>FLEXSPI0_FLEXSPI1</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM6</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM7</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>USDHC0</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>USDHC1</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>SGPIO_INTA</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>SGPIO_INTB</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>I3C0</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>USB0</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>USB0_NEEDCLK</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>WDT1</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>USB_PHYDCD</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>DMA1</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>PUF</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>POWERQUAD</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>CASPER</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>PMU_PMIC</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>HASHCRYPT</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM8</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM9</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM10</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM11</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM12</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM13</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM16</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>I3C1</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>LCDIF</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>GPU</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>MIPI</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>Reserved88</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>SDMA</name>
        <value>73</value>
      </interrupt>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ISER[%s]</name>
          <description>Interrupt Set Enable Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA0</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA1</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA2</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA3</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA4</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA5</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA6</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA7</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA8</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA9</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA10</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA11</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA12</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA13</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA14</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA15</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA16</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA17</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA18</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA19</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA20</name>
